# RenderingQualitySettings Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RenderingQualitySettings Members
RenderingQualitySettings Class Methods Properties See Also
---
The RenderingQualitySettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RenderingQualitySettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsCustomQuality | Checks if the current rendering quality is custom or not. |
| IsValidRenderLevel | Validate the render level is between 1 and 40 |
| IsValidRenderTime | Validate the render time is between 1 and 32768. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LightAndMaterialAccuracyMode | A value that controls light and material accuracy mode. |
| RenderDuration | A value that controls render duration. |
| RenderingQuality | The quality applied for rendering. |
| RenderLevel | The render target level as a numerical value between 1 and 40. |
| RenderTime | The render target time as a numerical value between 1 and 32768. |

# See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace